
#Область ПрограммныйИнтерфейс

// Обработчик элемента очереди в режиме работы бота - Эхо-бот
// 
// Параметры:
//  ДанныеЭлемента - Структура
ChatID = Строка(Сообщение.chat.id);

// ПОКАЗЫВАЕМ КЛАВИАТУРУ ПРИ ПЕРВОМ СООБЩЕНИИ
Если НЕ КлавиатураУжеПоказана(ChatID) Тогда

    ИнтеграцияТелеграм.ОтправитьСообщениеСВариантами(
        ChatID,
        "Выберите действие:",
        "🏠 Меню",
        "🆘 Помощь",
        "📞 Контакты",
        "⚙ Настройки"
    );

    ОтметитьКлавиатуруПоказанной(ChatID);
    Возврат;

КонецЕсли;

	
КонецПроцедуры

#КонецОбласти
