
#Область ПрограммныйИнтерфейс

// Обработчик элемента очереди в режиме работы бота - Эхо-бот
// 
// Параметры:
//  ДанныеЭлемента - Структура
Процедура ПриОбработкеЭлементаОчереди(ДанныеЭлемента) Экспорт
	Сообщение = ДанныеЭлемента.message;
	Текст = "";
	Если Сообщение.Свойство("text") Тогда
		Текст = Сообщение.text;
	КонецЕсли;
	
	Если Текст = "/start" Тогда
	
		СообщениеСтарт =
	"Привет! Мы — команда NextWW." + Символы.ПС +
	"Мы создали этот симулятор, потому что верим: чтобы найти свою профессию в IT, её нужно сначала почувствовать. Не через теорию, а через реальные практические задачи." + Символы.ПС +
	"Пока мы открыли путь в три ключевые и востребованные области: 1С-разработчик, разработчик игр на Unreal Engine и бэкенд-разработчик." + Символы.ПС +
	"Наша цель — помочь вам не просто выбрать, а примерить на себя роль специалиста. Узнать на собственном опыте, какая работа — с её типичными вызовами, логикой и драйвом — откликается именно вам." + Символы.ПС +
	"Принцип прост: «Попробуй, прежде чем решить». Погрузитесь в симуляцию, выполните задания и сделайте свой осознанный выбор. Давайте вместе найдем ваш путь.";
	
		Доп = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
		Доп.Клавиатура = КлавиатураСтартInline();
		ChatID = Сообщение.chat.id;
	
		ИнтеграцияТелеграм.ОтправитьСообщение(ChatID, СообщениеСтарт, Доп);
	
		Возврат;
	
	КонецЕсли;
	
	Если ДанныеЭлемента.Свойство("message") Тогда
		
		Сообщение = ДанныеЭлемента.message;
		
		Если Не Сообщение.Свойство("from") Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Сообщение.Свойство("text") Тогда
			Возврат;
		КонецЕсли;
		
		Отправитель = Сообщение.from.id;
		Текст = Сообщение.text;
		
		ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, Текст);
		
	КонецЕсли;	
	
КонецПроцедуры

Функция КлавиатураСтартInline() Экспорт

	Ряд1 = Новый Массив;
	Ряд1.Добавить(Новый Структура("text,callback_data", "Начать", "start"));

	Строки = Новый Массив;
	Строки.Добавить(Ряд1);

	Возврат Новый Структура("inline_keyboard", Строки);

КонецФункции


#КонецОбласти
